<?php
return [
    200 => 'ok',
    303 => '输入的数据不合法',
    501 => '插入数据失败',
    502 => '更新数据失败',
    503 => '删除数据失败',
    //login code [1001-1010]
    1001 => '账号不存在',
    1002 => '密码错误',
    1003 => '账号已被禁用，请联系管理员',
    1004 => '验证码输入错误',

    //user code 
    1011 => '输入的账号已存在',
    1012 => '两次密码输入不一致',
    1013 => '旧密码输入错误',

    //finance
    2000 => '审核参数不正确',
    2001 => '审核插入数据失败',
    
    //pay
    3000 =>'支付失败，接口错误！',
    3001 =>'支付失败，参数缺失！',

    //账单
    4000 =>'更新状态失败',
    4001 =>'参数错误',
    4002 =>'参数缺失',
    4003 => '重复账单',

    //业务
    10000 =>'更新banner失败',
    10001 =>'验证数据失败',
    10002 =>'参数错误',
];